problems/+azevedo/@SimplySupportedBeam2d/meshes/simplySupportedBeam100x5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        nFaces          100;
        startFace       895;
    }
    left
    {
        type            wall;
        nFaces          5;
        startFace       995;
    }
    right
    {
        type            wall;
        nFaces          5;
        startFace       1000;
    }
    bottom
    {
        type            wall;
        nFaces          100;
        startFace       1005;
    }
    back
    {
        type            empty;
        nFaces          500;
        startFace       1105;
    }
    front
    {
        type            empty;
        nFaces          500;
        startFace       1605;
    }
)


// ************************************************************************* //
